# 데이터 그룹분석 & 피봇팅 연습문제

필요한 모듈 임포트

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

### 연습문제 1. 붓꽃(iris) 데이터

- seaborn 라이브러리에 있는 'iris' 데이터 로드

In [5]:
# 붓꽃(iris) 데이터 로드
iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

#### iris 데이터를 이용하여 다음의 문제를 해결하시오.

#### 1) 데이터 살펴보기

- 데이터 앞부분 보기

In [6]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

- 데이터 정보 확인(변수, 데이터유형 등)

In [7]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

#### 2) 붓꽃 품종(species)별로 데이터 그룹화

In [9]:
# 붓꽃 종 별로 그룹핑
groups = iris.groupby(iris.species)
groups.ngroups

3

#### 3) 품종별 꽃잎길이(petal_length)의 평균을 구하시오.

In [10]:
groups['petal_length'].mean()

species
setosa        1.462
versicolor    4.260
virginica     5.552
Name: petal_length, dtype: float64

#### 3) 품종별 꽃받침길이(sepal_length)의 평균을 구하시오.

In [11]:
groups['sepal_length'].mean()

species
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal_length, dtype: float64

----

### 연습문제 2. Tips 데이터

tips 데이터를 이용하여 다음의 문제를 해결하시오.

In [12]:
# seaborn 라이브러리의  tips 데이터 로드
tips = sns.load_dataset('tips')

#### 1) 데이터 살펴보기
- 데이터의 뒷부분 보기

In [13]:
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

변수 설명
- total_bill : 지불금액
- tips : 팁금액
- sex : 고객의 성별
- smoker : 흡연구역여부 (Yes: 흡연구역, No: 금연구역)
- time : 시간대
- size : 테이블당 인원수

데이터 정보 확인(변수, 데이터유형 등)

In [14]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

#### 2)  'total_bill' 대비 팁 요금(tip)의 비율을 계산하고 'tip_pt' 열로 저장하시오.

In [18]:
tips = tips.assign(tip_pt = tips['tip'] / tips['total_bill'])
tips.tail()

     total_bill   tip     sex smoker   day    time  size    tip_pt
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

#### 3) 요일별 손님의 수는?

In [21]:
groups2 =tips.groupby(tips['day'])
groups2['size'].sum()

C:\Users\User\AppData\Local\Temp\ipykernel_9972\3850101059.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  groups2 =tips.groupby(tips['day'])

day
Thur    152
Fri      40
Sat     219
Sun     216
Name: size, dtype: int64

- 팁의 비율이 요일과 점심/저녁 여부, 인원수에 어떤 영향을 받는지 살펴본다.

- 어떤 요인이 가장 크게 작용하는지 판단할 수 있는 방법이 있는가?

#### 4) 요일별 테이블당 평균인원수는?

In [19]:
groups2['size'].mean()

day
Thur    2.451613
Fri     2.105263
Sat     2.517241
Sun     2.842105
Name: size, dtype: float64

#### 5) 시간대(점심/저녁) 별 손님 수 비교

In [31]:
groups3 = tips.groupby(tips.time)
groups3['size'].sum()

C:\Users\User\AppData\Local\Temp\ipykernel_9972\2151283504.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  groups3 = tips.groupby(tips.time)

time
Lunch     164
Dinner    463
Name: size, dtype: int64

#### 6) 시간대(점심/저녁) 별 테이블당 평균인원수

In [33]:
groups3[['size']].mean()

            size
time
Lunch   2.411765
Dinner  2.630682

#### 7) 각 요일에 따른 시간대별(점심/저녁) 손님 수를 피봇테이블로 작성

In [41]:
pd.pivot_table(tips, index=['day'], columns=['time'], values=['size'],
              aggfunc='sum')

      size
time Lunch Dinner
day
Thur   150      2
Fri     14     26
Sat      0    219
Sun      0    216

#### 8) 요일별 테이블당 평균 인원수와  최대인원수, 최소인원수를 피봇테이블로 작성

In [43]:
pd.pivot_table(tips, index=['day'], values=['size'],
              aggfunc=['mean','max','min'])

          mean  max  min
          size size size
day
Thur  2.451613    6    1
Fri   2.105263    4    1
Sat   2.517241    5    1
Sun   2.842105    6    2

#### 9) 요일별 시간대에 따른 테이블당 평균, 최대, 최소 인원수를 피봇테이블로 작성

In [44]:
pd.pivot_table(tips, index=['day','time'], values=['size'],
              aggfunc=['mean','max','min'])

                 mean  max  min
                 size size size
day  time
Thur Lunch   2.459016  6.0  1.0
     Dinner  2.000000  2.0  2.0
Fri  Lunch   2.000000  3.0  1.0
     Dinner  2.166667  4.0  2.0
Sat  Dinner  2.517241  5.0  1.0
Sun  Dinner  2.842105  6.0  2.0

#### 10) 각 시간대별로 요일에 따른 테이블당 평균, 최대, 최소 인원수를 피봇테이블로 작성

In [45]:
pd.options.display.float_format = '{:.2f}'.format

In [47]:
pd.pivot_table(tips, index=['time'], columns=['day'], values=['size'],
              aggfunc=['mean','max','min'], fill_value=0)

       mean                 max                 min
       size                size                size
day    Thur  Fri  Sat  Sun Thur  Fri  Sat  Sun Thur  Fri  Sat  Sun
time
Lunch  2.46 2.00 0.00 0.00 6.00 3.00 0.00 0.00 1.00 1.00 0.00 0.00
Dinner 2.00 2.17 2.52 2.84 2.00 4.00 5.00 6.00 2.00 2.00 1.00 2.00

#### 11) 요일별 tip_pt의 평균 계산

In [48]:
groups4 = tips.groupby(tips.day)

C:\Users\User\AppData\Local\Temp\ipykernel_9972\2432024510.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  groups4 = tips.groupby(tips.day)

In [50]:
groups4[['tip_pt']].mean()

      tip_pt
day
Thur    0.16
Fri     0.17
Sat     0.15
Sun     0.17

#### 12) 시간대별 tip_pt의 평균 계산

In [51]:
groups3[['tip_pt']].mean()

        tip_pt
time
Lunch     0.16
Dinner    0.16

#### 11) 각 요일마다 시간대(점심/저녁) 별 tip_pt의 평균

In [52]:
pd.options.display.float_format = '{:.4f}'.format

In [53]:
pd.pivot_table(tips, index=['day','time'], values=['tip_pt'],
              aggfunc='mean')

             tip_pt
day  time
Thur Lunch   0.1613
     Dinner  0.1597
Fri  Lunch   0.1888
     Dinner  0.1589
Sat  Dinner  0.1532
Sun  Dinner  0.1669

#### 12) 요일마다 시간대(점심/저녁) 별 평균인원수와 팁비율의 평균 계산

In [54]:
pd.pivot_table(tips, index=['day','time'], 
               values=['size','tip_pt'],
                aggfunc='mean')

              size  tip_pt
day  time
Thur Lunch  2.4590  0.1613
     Dinner 2.0000  0.1597
Fri  Lunch  2.0000  0.1888
     Dinner 2.1667  0.1589
Sat  Dinner 2.5172  0.1532
Sun  Dinner 2.8421  0.1669

----

### 연습문제 3. titanic 데이터

타이타닉 승객 데이터를 이용하여 다음 분석을 수행하시오.

#### 1) 데이터 로드

In [3]:
# seaborn 라이브러리의 titanic 데이터 로드
titanic = sns.load_dataset('titanic')

#### 2) 데이터 살펴보기

In [4]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

#### 3) 나이(age)를 qcut을 사용하여 세 개의 그룹으로 만든다.
- label은 ['청년','중년','장년']

In [11]:
qcut = pd.qcut(titanic['age'], 3, labels=['청년','중년','장년'])
qcut

0       청년
1       장년
2       중년
3       장년
4       장년
      ...
886     중년
887     청년
888    NaN
889     중년
890     중년
Name: age, Length: 891, dtype: category
Categories (3, object): ['청년' < '중년' < '장년']

#### 4) 선실(class), 성별(sex), 나이 그룹에 따른 생존여부 그룹으로 그룹화

In [16]:
titanic['age_group'] = qcut
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_group
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,청년
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,장년
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,중년
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,장년
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,장년

In [17]:
group_c = titanic.groupby(['class','sex','age_group','survived'])
group_c

C:\Users\User\AppData\Local\Temp\ipykernel_10428\2317222731.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  group_c = titanic.groupby(['class','sex','age_group','survived'])

#### 5) 선실, 성별, 나이 그룹에 따른 생존여부에 대한 빈도를 데이터프레임으로 생성

- 행에는 선실, 성별, 나이그룹에 대한 다중 인덱스를 사용하고 열에는 생존 인덱스를 사용한다.

In [12]:
titanic['age_group'] = qcut
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_group
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,청년
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,장년
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,중년
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,장년
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,장년

In [18]:
pd.pivot_table(titanic, index=['class','sex','age_group'], columns='alive', 
               values='survived', aggfunc='count')

alive                    no  yes
class  sex    age_group
First  female 청년          1   21
              중년          1   18
              장년          1   43
       male   청년          5    5
              중년         11   11
              장년         45   24
Second female 청년          0   20
              중년          3   30
              장년          3   18
       male   청년         18   10
              중년         36    3
              장년         30    2
Third  female 청년         29   30
              중년         14   13
              장년         12    4
       male   청년         90   17
              중년         74   18
              장년         51    3

#### 6) 선실, 성별, 나이 그룹에 따른 생존여부에 대한 빈도를 피봇테이블로 생성

In [21]:
df = pd.pivot_table(titanic, index=['sex','age_group'], columns=['class','alive'], 
                    values='survived', aggfunc='count')
df

class            First     Second     Third
alive               no yes     no yes    no yes
sex    age_group
female 청년            1  21      0  20    29  30
       중년            1  18      3  30    14  13
       장년            1  43      3  18    12   4
male   청년            5   5     18  10    90  17
       중년           11  11     36   3    74  18
       장년           45  24     30   2    51   3

#### 7) 6)에서 생성한 데이터프레임을 이용하여 성별과 나이그룹에 따른 First class 인원수를 파악하라

In [25]:
df['First'].sum(axis=1)

sex     age_group
female  청년           22
        중년           19
        장년           44
male    청년           10
        중년           22
        장년           69
dtype: int64

#### 8) 6)에서 생성한 데이터프레임을 이용하여 성별, 나이그룹, 선실별에 따른 생존율을 파악하시오.
- 행은 성별, 나이그룹의 다중인덱스로 하고, 열은 선실(class)로 한다.
- 생존률은 해당 그룹의 생존 인원수를 전체 인원수로 나눈 값이다.

In [102]:
df.columns

MultiIndex([('survived',  'First',  'no'),
            ('survived',  'First', 'yes'),
            ('survived', 'Second',  'no'),
            ('survived', 'Second', 'yes'),
            ('survived',  'Third',  'no'),
            ('survived',  'Third', 'yes')],
           names=[None, 'class', 'alive'])

In [29]:
df.sum().sum()
df['survived',  'First', 'yes'].sum(axis=0)
# values = df / df.sum()
# df.pivot(index=['sex','age_group'], columns=['class'], values=)

714

KeyError: 'Key length (3) exceeds index depth (2)'

                   First   Second   Third
sex    age_group
female 청년        95.4545 100.0000 50.8475
       중년        94.7368  90.9091 48.1481
       장년        97.7273  85.7143 25.0000
male   청년        50.0000  35.7143 15.8879
       중년        50.0000   7.6923 19.5652
       장년        34.7826   6.2500  5.5556

#### 9) 성별 및 선실에 의한 생존율을 피봇 데이터 형태로 만든다.

In [34]:
survivor_rate.pivot_table(index='sex')

         First  Second   Third
sex
female 95.9729 92.2078 41.3319
male   44.9275 16.5522 13.6695